<a href="https://colab.research.google.com/github/GCardoso-lab/titanic-case/blob/main/Main.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Understand

## Business Understand

* Create a preditive model to predict the chance of survival in the acident from the ship.

### Data Understand



*   survival - 0-1 - Person survived?
*   pclass - 1,2,3 - Class of ticket    ::  Most down = less chance?
*   sex - M,F - Sex of passenger        ::  Males have priority in boats = more survive chance?
*   sibsp - 1,2,3... - ??
*   parch - 1,2,3... - Number of parents in ship :: Most parents together = less chance?
*   ticket - 1,2,3,... - Number ticket
*   fare - 1,2,3... - ??
*   cabin - 1,2,3... - Cabin number
*   embarked - C,Q,S - Port of embarkation

# Data Analysis

In [124]:
# Import's
import pandas as pd
import seaborn as sns

In [125]:
# Read data
df_original = pd.read_csv('data/train.csv')
df = df_original

In [126]:
# Get types of each column
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [127]:
# Get summary values
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [128]:
# Number of null values in columns
is_null = df.isnull().sum()
# Number of columns with values
not_null =  df.notnull().sum()

# Total os rows
total = is_null + not_null

is_null['Percentage'] = (is_null / total) * 100
is_null['Total'] = total
is_null['Not_Null_Values'] = not_null
is_null['Null_Values'] = total - not_null


df_analysis = pd.concat([is_null['Percentage'], is_null['Null_Values'], is_null['Not_Null_Values'], is_null['Total']], axis=1)

df_analysis.columns = ['Percentage', 'Null_Values', 'Not_Null_Values', 'Total']

df_analysis

# Age = Replace by mean
# Cabin = Drop column
# Embarked = Drop row

             Percentage  Null_Values  Not_Null_Values  Total
PassengerId    0.000000            0              891    891
Survived       0.000000            0              891    891
Pclass         0.000000            0              891    891
Name           0.000000            0              891    891
Sex            0.000000            0              891    891
Age           19.865320          177              714    891
SibSp          0.000000            0              891    891
Parch          0.000000            0              891    891
Ticket         0.000000            0              891    891
Fare           0.000000            0              891    891
Cabin         77.104377          687              204    891
Embarked       0.224467            2              889    891

In [129]:
# Get dummies from df.Sex and save in DataFrame
sex_dummies = pd.get_dummies(df['Sex'])
df = pd.concat([df, sex_dummies], axis=1)

In [130]:
# Drop df.Sex column to use dummies
df = df.drop(['Sex'], axis=1)

In [131]:
# Replace df.Age NaN values to mean
df['Age'].fillna((df['Age'].mean()), inplace=True)

In [132]:
# Drop df.Cabin (78% of rows with NaN values)
df = df.drop(['Cabin'], axis=1)

In [133]:
# Drop 2 rows values with NaN in df.Embarked
df = df.dropna(how='any')

In [134]:
df

     PassengerId  Survived  Pclass  ... Embarked  female  male
0              1         0       3  ...        S       0     1
1              2         1       1  ...        C       1     0
2              3         1       3  ...        S       1     0
3              4         1       1  ...        S       1     0
4              5         0       3  ...        S       0     1
..           ...       ...     ...  ...      ...     ...   ...
886          887         0       2  ...        S       0     1
887          888         1       1  ...        S       1     0
888          889         0       3  ...        S       1     0
889          890         1       1  ...        C       0     1
890          891         0       3  ...        Q       0     1

[889 rows x 12 columns]

In [136]:
# Number of null values in columns
is_null = df.isnull().sum()
# Number of columns with values
not_null =  df.notnull().sum()

# Total of rows
total = is_null + not_null

is_null['Percentage'] = (is_null / total) * 100
is_null['Total'] = total
is_null['Not_Null_Values'] = not_null
is_null['Null_Values'] = total - not_null


df_analysis = pd.concat([is_null['Percentage'], is_null['Null_Values'], is_null['Not_Null_Values'], is_null['Total']], axis=1)

df_analysis.columns = ['Percentage', 'Null_Values', 'Not_Null_Values', 'Total']

df_analysis

             Percentage  Null_Values  Not_Null_Values  Total
PassengerId         0.0            0              889    889
Survived            0.0            0              889    889
Pclass              0.0            0              889    889
Name                0.0            0              889    889
Age                 0.0            0              889    889
SibSp               0.0            0              889    889
Parch               0.0            0              889    889
Ticket              0.0            0              889    889
Fare                0.0            0              889    889
Embarked            0.0            0              889    889
female              0.0            0              889    889
male                0.0            0              889    889